# ConvertFromProjectTime Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteLocation..::..ConvertFromProjectTime Method
SiteLocation Class See Also
---
Converts project time to UTC time.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DateTime ConvertFromProjectTime(
	DateTime projectTime
)
```

Visual Basic
---
```text
Public Function ConvertFromProjectTime ( _
	projectTime As DateTime _
) As DateTime
```

Visual C++
---
```text
public:
DateTime ConvertFromProjectTime(
	DateTime projectTime
)
```

# ### Parameters
projectTime
    Type: System..::..DateTimeThe project time.
# Remarks
Daylight savings time is not considered during this conversion.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the projectTime's kind is not Unspecified. |

# See Also
SiteLocation Class
Autodesk.Revit.DB Namespace